SunCity/src/DataProcessors/ПомощникЗаполненияПричинСписания/ПомощникЗаполненияПричинСписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникЗаполненияПричинСписания</name>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриказНаПроведениеИнвентаризацииТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.АналитикаХозяйственныхОпераций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаХозяйственнойОперации</name>
      <type>
        <types>CatalogRef.АналитикаХозяйственныхОпераций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

SunCity/src/DataProcessors/ПомощникЗаполненияПричинСписания/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("АналитикаХозяйственнойОперации", Справочники.АналитикаХозяйственныхОпераций.ПустаяСсылка());
	
	МассивСтрок = Товары.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = Товары.Количество() Тогда
		
		Текст = НСтр("ru = 'Не заполнены причины списания'");
		ОбщегоНазначения.СообщитьПользователю(
			Текст,
			ЭтотОбъект,
			"Товары",
			,
			Отказ);
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	ОбработкаТабличнойЧастиТоварыСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
